Repository: 84000/translation-memory-resources
Catalog: post_input/toh287-C.bo.en.tmx
Source language: bo
Languages: en

source: ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ དག་ གིས་ ཤེས་པ ར་ འགྱུར་ ཏེ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ དག་ དང་ །_ ལྷ་མ་ ཡིན་ སྐར་ ཕྲེང་ གི་ གྲོང་ [19a] ཁྱེར་ ན་ གནས་པ་ དང་ །_ གཞན་ ཚལ་ དང་ ནགས་ཚལ་ ན་ གནས་པ་ དེ་དག་ ཐམས་ཅད་ ཡི་མུག་ ཅིང་ བྱིན་ ཉམས་ ལ་ བཞིན་ ངོ་ཚ་ ནས་ ཁྱིམ་ དུ་ ཕྱིར་ ལྷགས་ ཏེ །_
en: When the necklace asuras come to know of that defeat, they and all the asuras who live in the city of Star Garland, [19.a] as well as in the surrounding groves and forests, will become gloomy, downcast, and ashamed, and will thus return home.

source: ཀྱེ་ ཨེ་མ་ ལྷ་མ་ ཡིན་ བདག་ཅག་ རྣམས་ ཀྱིས་ ལྷ་ རྣམས་ ཐུབ་པ ར་ མ་ནུ ས་ ལ་ བྱིན་ ཉམས་ སོ །_།
en: ‘Alas,’ they will think, ‘it turns out that we asuras are incapable of defeating the gods.

source: གང་ གི་ ཚེ་ བདག་ཅག་ གིས་ ལྷ་ རྣམས་ ཕམ་པ ར་ བྱེད་ ནུས་ ཞིག་ གུ་ ཞེས་ དེ་སྐད་ སྨྲས་ ནས །_
en: When will the day come that we finally vanquish the gods?’

source: ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ དག་ གིས་ སྒྲ་གཅན་ ལ །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ འདི་ལྟར་ སླད་ ཀྱིས་ ཡུན་ མི་ རིང་བ ར་ བདག་ཅག་ གིས་ ལྷ་ རྣམས་ ཕམ་པ ར་ བགྱིད་པ ར་ རྔོ་ ཐོགས་ ཀྱིས་ ནན་ཏན་ མཛད་ དུ་ གསོལ་ ཞེས་ སྨྲས་པ་ དང་ །_
en: $125 “At that point the necklace asuras and the asura king Firm will approach Rāhu, saying, ‘Ruler of the asuras, please ensure that we may soon succeed in defeating the gods.’

source: དེ་སྐད་ ཐོས་ ནས ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ གྱིས་ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ དང་ །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ དག་ ལ་ འདི་ལྟར་ ངས་ ཡུན་ མི་ རིང་བ ར་ ལྷ་ དག་ དབང་པོ་ དང་ བཅས་ ཏེ ཐུབ་པ ར་ བྱ་ ཡིས་ སྙིང་ལས་ ཆུང་ངུ ར་ འཁོད་ ཅིག་ ཅེས་ སྨྲས་ སོ །_།
en: $126 “When approached in this way, Rāhu, ruler of the asuras, will say to the necklace asuras and the asura king Firm, ‘I shall soon conquer the gods and their king, so do not worry much!’

source: སྒྲ་གཅན་ ལས་ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ དག་ གིས་ དེ་སྐད་ ཐོས་ ནས །_ དེ་ནས་ ཡིད་ རབ་ཏུ་ དགའ་ སྟེ །_ རང་ གི་ གནས་ སུ་ ཞུགས་ སོ །_།
en: When they hear Rāhu say this, the necklace asuras will be overjoyed and thus return to their homes.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེས་ ལྷ་མ་ ཡིན་ གྱི་ གྲོང་ཁྱེར་ སྐར་ ཕྲེང་ ཞེས་ བྱ་བ་ ལ་ བརྟགས་ ནས །_ ཕྱི་རོལ་ ལ་ ཡང་ སོ་སོ ར་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $127 “As the monk who has knowledge of the effects of the ripening of karmic actions continues to examine the city of the asuras known as Star Garland, he will proceed to examine the surroundings of the city, wondering,

source: མགུལ་ ཕྲེང་ ཞེས་ བྱ་བ་ དག་ གིས་ གཞན་ ཕྱི་རོལ་ གྱི་ ཚལ་ དང་ །_ ནགས་ཚལ་ རྣམ་པ་ དུ་ཡོད་ སྙམ་ ནས །_
en: ‘How many groves and forests might the necklace asuras possess?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ ཞེས་ བྱ་བ་ དག་ གི་ ཚལ་ དང་ །_
en: With knowledge derived from hearing he will see that the necklace asuras have seven forests that extend across thirty million leagues.

source: བྱ་ རྣམས་ དང་ །_ ནགས་ཚལ་ དང་ །_ ཉེ་བ འི་ ཚལ་ དང་ །_ ལྟེང་ཀ་ དང་ །_ འབབ་ཆུ འི་ དངོ་ དང་ །_ པད་མ འི་ རྫིང་ རྣམས་ ཀྱིས་ དཔག་ཚད་ ཁྲི་ཕྲག་ སུམ་ སྟོང་ དུ་ གང་བ །_ བྱ་ ངང་པ་ དང་ །_ ཀཱ་ རཎྜ་བ་ དང་ །_ ངུར་པ་ དག་ གིས་
en: That area is full of groves inhabited by birds. In the forests lie many pools, waterfalls, and lotus ponds where lovely swans, ducks, and yellow geese frolic.

source: མཛེས་པ ར་ བྱས་ ཤིང་ ཉེ་བ ར་ བརྒྱན་ ལ་ ཀུན་ ཏུ་ སྡུག་པ ར་ བྱས་པ །_ ཀུན་ ནས་ ཉམས་ དགའ་བ །_ སྤྲོ་ ཞིང་ རབ་ཏུ་ དགའ་ ལ །_ རྟག་ ཏུ་ མང་བ་ ཇི་ལྟ ར་ འདུག་པ་ མཐོང་ སྟེ
en: The forests are beautiful, pleasant, delightful, bountiful, and a constant source of pleasure.

source: དེ་ ན་ ཚལ་ ཆེན་པོ་ བདུན་ ཡོད་པ་ ལ་ འདི་ལྟ་སྟེ །_
en: These seven forests in the land of the necklace asuras are known by the following names:

source: གསེར་ གྱི་ འོག་ ཕག་ སྤྲིན་ དང་ །_ རྟག་ ཏུ་ ཉམས་ དགའ་ དང་ །_ སྐྱེད་མོས་ཚལ་ དགའ་ དང་ །_ འབྲས་བུ་རྟག་ ཏུ་ མཛེས་ དང་ །_ རླུང་ བདེ་ དང་ །_ ཏིན་ དི་ ཀུན་དགའ་ དང་ །_ སྤྲས་པ་ སྟེ །_
en: Cloud below Gold,#232Always Delightful, Lovely Pleasure Garden, Fruits of Constant Beauty, Pleasant Breeze, Always Joyous,#233 and Adorned.

source: དེ་དག་ ནི་ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ [19b] དག་ གི་ སྐྱེ་བོ་ གནས་པ འི་ ཚལ་ ཆེན་པོ་ དག་ ཡིན་ ནོ །_། ས་ དེ་དག་ ཀྱང་ ལྷ་མ་ ཡིན་ རྟག་ ཏུ་ དགའ་བ་ རྣམས་ ཀྱིས་ གང་བ་ ཡིན་ ཏེ །_ ལྷ་མ་ ཡིན་ ལས་ ཀྱི་ འབྲས་བུ་ ལ་ སྤྱོད་པ་ རྣམས་ གནས་པ ར་ མཐོང་ ངོ་ །_།
en: [19.b] This land is rife with asuras who enjoy themselves due to the karmic effects that are experienced by asuras.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ་ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ དག་ གི་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_ མགུལ་ ཕྲེང་ དག་ ལས་ གང་ གིས་ དེར་ སྐྱེ་བ ར་ འགྱུར་ སྙམ་ ནས །_
en: $128 “As the monk who has knowledge of the effects of the ripening of karmic actions concerns himself with the ripening of karmic action as experienced by the asuras, he will ask himself, ‘What actions lead to birth as a necklace asura?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ ཕྱི་རོལ་པ་ གང་ གིས་ གཏན་པ་ དང་ བཅས་པ །_ སྡིག་པ་ དང་ བཅས་པ །_ སྐྱོན་ དང་ བཅས་པ ས་
en: When inquiring with knowledge derived from hearing, he will see how some non-Buddhists make offerings in a way that is limited, unwholesome, and flawed.

source: མཆོད་སྦྱིན་ བྱས་ ཤིང་ བཟའ་བ་ དང་ །_ བཅའ་བ་ རབ་ཏུ་ མང་པོ་ དག་ བཤམས་ ནས །_ ཚུལ་ཁྲིམས་ དང་ ལྡན་པ་ ལ་མ་ བྱིན །_
en: Although they arrange much food and drink, they do not offer it to individuals who observe spiritual discipline.

source: སེམས་ ཀྱིས་ མ་ བསྒོམས་པ འི་ སྦྱིན་པ་ ངན་པ་ སྦྱིན་པ་ དེ་ བྱིན་པ་ དེ་ ནི་
en: Instead, they offer it as an unwholesome gift to those with untrained minds.#234

source: ལུས་ དང་ བྲལ་ ནས་ ངན་འགྲོ་ ལོག་པ ར་ ལྟུང་བ་ དུད་འགྲོ འི་ འགྲོ་བ་ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ རྣམས་ ཀྱི་ ནང་ དུ་ སྐྱེ་བ ར་ འགྱུར་ ལ །_
en: When they later separate from their bodies, such people will fall into the lower realms and be born as necklace asuras within the animal realm.

source: སྦྱིན་པ་ ཐ་མ་ དང་ །_ འབྲིང་ དང་ །_ མཆོག་ རྣམས་ ཀྱིས་ བདེ་བ་ ཐ་མ་ དང་ །_ འབྲིང་ དང་ །_ མཆོག་ མྱོང་བ ར་ འགྱུར་ ཏེ
en: Their respective level of happiness will depend on whether their offerings were minor, mediocre, or great.

source: རྒྱུ་ དང་ འཐུན་ པར་ འབྲས་བུ་འབྱུང་ བར་ འགྱུར་བ་ མཐོང་ ངོ་ །_།
en: They will experience karmic effects that accord with their causes.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ འི་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $129 “Next, the monk who has knowledge of the effects of the ripening of karmic actions will examine the karmic ripening that is experienced by the asura king Firm.

source: ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ གང་ གིས་ བརྟན་པ་ དག་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ རྒྱལ་སྲིད་ བྱེད་ སྙམ་ ནས་
en: In this regard, he will wonder, ‘What karmic actions ripen as the attainment of Firm’s rule over the asuras?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ འདི་ལྟར་ མིར་ གྱུར་པ །_ རྐུན་མ་ གཞན་ གྱི་ ནོར་རྫས་ ཀྱིས་ འཚོ་བ །_ སེམས་པ་ དང་ བྲལ་བ འི་ སེམས་ ཀྱིས་ ཕྱི་རོལ་པ འི་ འདོད་ཆགས་ དང་ བྲལ་བ་ གཅིག་ ལ་ ཟས་ ཀྱིས་ ཚིམ་པ ར་ བྱིན་པ འི་ ལས་ དེས་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ རྒྱལ་སྲིད་ བྱེད་པ་ མཐོང་ ངོ་ །_།
en: Investigating with knowledge derived from hearing, he will then see that when a human thief, who lives from the wealth of others, carelessly offers food to satisfy a non-Buddhist practitioner who has attained freedom from desire, that act will make the person become ruler of the asuras.

source: དེ་ནས་ ཡང་ དགེ་སློང་ དེ་ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ ཞེས་ བྱ་བ འི་ ཚེ་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $130 “Next, the monk will examine the lifespan of the necklace asuras, wondering,

source: ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ གི་ ཚེ འི་ ཚད་ ཇི་སྲིད་ དུ་ ཐུབ་ སྙམ་ ནས །_
en: ‘How long may the necklace asuras live?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ འམ །_ ལྷ འི་ མིག་ གིས་ བརྟགས་ ན །_ མི་ རྣམས་ ཀྱི་ ལོ་ དྲུག་ བརྒྱ་ གང་ཡིན་པ་ དེ་དག་ ནི་ ལྷ་མ་ ཡིན་ མགུལ་ ཕྲེང་ རྣམས་ ཀྱིས་ ཉིན་ཞག་ གཅིག་ ལ་ གྲངས་ བརྩིས་པ་ དེ འི་ ལོ་ དྲུག་ སྟོང་ ཐུབ་ སྟེ །_ དུས་ མ་ཡིན་པ ར་ [20a] འཆི་བ་ ནི་ ཡོད་ དོ །_།
en: Examining this matter with knowledge derived from hearing or with the divine eye, the monk will see that six hundred human years make one day and night among the necklace asuras and that they live for six thousand years made of such days. [20.a] However, they may also die prematurely.

source: ལེགས་པ ར་ བྱས་པ་ དང་ །_ ཉེས་པ ར་ བྱས་པ འི་ ལས་ ཀྱི་ འབྲས་བུ་ ནི་ལ ས་ ཐམས་ཅད་ ལ་ རག་ ལས་པ་ ཡིན་ ནོ །_།
en: The effects of positive and negative actions depend on the totality of their actions.

source: དེས་ དུད་འགྲོ འི་ འགྲོ་བ ར་ བསྡུས་པ་ ལྷ་མ་ ཡིན་ གཉིས་པ་ དག་ གི་ ས་ ལ་ བརྟགས་ ན །_ ཆོས་ ལ་ ཆོས་ ཀྱི་ རྗེས་སུ་ ལྟ་ ཞིང་ གནས་ སོ །_།
en: $131 “As the monk examines the second level of asuras, which is a class of beings that belongs to the animal realm, he observes and abides by the Dharma.

source: སེམས་ཅན་ འཁོར་བ ར་ གཏོགས་པ་ ཐམས་ཅད་ ནི་ ཆོས་ ལ་ རྟེན་པ །_ ཆོས་ ཀྱི་ འགྲོ་བ་ ཆོས་སྐྱོབ་པ་ ཡིན་ ཏེ །_ ལེགས་པ ར་ བྱས་པ ས་ ལྷ་ དང་ མི་ རྣམས་ ཀྱི་ ནང་ དུ་ སྐྱེ་ ལ །_ ཉེས་པ ར་ བྱས་པ ས་ སེམས་ཅན་ དམྱལ་བ་ དང་ །_ ཡི་དགས་ དང་ །_ དུད་འགྲོ་ རྣམས་ ཀྱི་ ནང་ དུ་ སྐྱེ་བ ར་ འགྱུར་ རོ །_།
en: He understands that all beings in cyclic existence depend on the Dharma and are protected by the Dharma—through wholesome actions they are born among gods and humans and through unwholesome actions they are born among hell beings, starving spirits, and animals.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $132 “Next, the monk who has knowledge of the effects of the ripening of karmic actions will wonder,

source: ཇི་ལྟ ར་ ན་ ལྷ་ ཀུན་ ཏུ་ རྒྱུ་བ་ རྣམས་ གནོད་སྦྱིན་ རྫུ་འཕྲུལ་ ཆེན་པོ་ རྣམས་ ལས་ ཐོས་ ནས །_ ཅི་ཞིག་ བྱེད་ ཅིག་ གུ་ སྙམ་ ནས །_
en: ‘How will the wandering gods respond to the message they receive from the yakṣas who have great miraculous powers?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ འདི་ལྟར་ ལྷ་ ཀུན་ ཏུ་ རྒྱུ་བ་ རྣམས་ རྒྱལ་ཆེན་ བཞི་ དང་ ལྷ་ ཕྲེང་ཐོགས་ རྣམས་ ལ་
en: $133 “As he inquires with knowledge derived from hearing, the monk will notice how the wandering gods utter the following words to the Four Great Kings and the garland-bearer gods:

source: འདི་ལྟར་ ལྷ་མ་ ཡིན་ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་པ་ རྣམས་ ཀྱིས་ ཀླུ་ རྣམས་ ལ་ འདི་ལྟར་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ མི་ རྒྱུ་ གང་ གིས་ འཆི་བ འི་ དུས་བྱ ས་ ནས །_ ལྷ་ རྣམས་ ཀྱི་ ནང་ དུ་ སྐྱེ་བ ར་ འགྱུར་བ་ རྣམས་ ལ་བར་ ཆད་ བྱ་བ ར་ འབོད་ ཅིག _།
en: ‘We have heard that the unrighteous asuras who do not follow the Dharma have called on the nāgas to create obstacles for those righteous humans who follow the Dharma and who therefore create the causes for attaining divine births subsequent to their deaths.

source: དེ་དག་ སྦྱིན་པ་ དང་ །_ ཚུལ་ཁྲིམས་ དང་ །_ ཤེས་པ་ ཐམས་ཅད་ ཀྱང་ ཁ་ཟས་ ལ་ རག་ ལས་པ་ ཡིན་ ལ །_ དེ་དག་ ཀྱང་ ཁ་ཟས་ ལ་ རྟེན་པ་ ཡིན་པ ས །_
en: The asuras have told the nāgas that all the generosity, spiritual discipline, and knowledge of such virtuous people is entirely dependent on food.

source: འཛམ་བུ འི་ གླིང་ དུ་ ཁྱེད་ དེང་ ལ །_ ལོ་ཏོག་ ཐམས་ཅད་ དབྲོག་པ་ དང་ །_ འབྲུ་ ཐམས་ཅད་ མ་ རུང་བ ར་ བྱ་བ འི་ ཆར་ ཕོབ་ ཤིག་ ཅེས་ རབ་ཏུ་ གཟེངས་ སྟོད་པ ར་ བྱེད་པ་ དེ་དག་ བདག་ཅག་ ལ་ བསྙད་ དོ །_།
en: They therefore encouraged the nāgas to travel to Jambudvīpa and let a rain pour down that will deprive all humans of their crops and destroy their grains.

source: ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ་ བར་སྣང་ ལ་ རྒྱུ་བ འི་ གནོད་སྦྱིན་ གང་ཡིན་པ་ དེ་ རྣམས་ ཀྱིས་ ཀྱང་ དེ་དག་ བདག་ཅག་ ལ་ བསྙད་ ལ །_
en: This we have been told by the righteous sky-traveling yakṣas that follow the Dharma, and now we inform you.

source: བདག་ཅག་ གིས་ ཀྱང་ ཁྱེད་ཅག་ ལ་ བསྙད་པ་ ལགས་སོ །_། ཁྱེད་ཅག་ གིས་ ཀྱང་ ཉེ་བ་ ན་ གནས་པ འི་ ལྷ་ གང་ཡོད་པ་ དེ་དག་ ལ་ བསྙད་ ཅིང་ །_ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ རྣམས་ ཀྱིས་ ཀྱང་ པི་ བང་ ཅན་ གསུམ་པ་ རྣམས་ ལ །_ པི་ བང་ ཅན་ གསུམ་པ་ རྣམས་ ཀྱིས་ ཀྱང་ རྟག་ ཏུ་ མྱོས་པ་ རྣམས་ ལ་ བསྙད་ དེ
en: You too should pass this news on to the gods near you so that the vessel bearers can inform the triple-lute-bearers, who in turn should pass the message to the ever-ecstatic gods.’

source: དེ་ལྟ ར་ རྒྱལ་ཆེན་ [20b] བཞི་པ་ རྣམས་ ཀྱིས་ ཆོས་ དང་ མི་ འཐུན་པ་ འདི་ རྒྱ་ ཆེ ར་ བསྙད་ དོ །_། སོ་སོ འི་ བྱེ་བྲག་ ཇི་ལྟ་བུ་ ཡིན་པ་ རྒྱལ་ཆེན་ བཞི་པ་ དེ་ རྣམས་ ཀྱིས་ ཀྱང་ གྲོང་ཁྱེར་ ཆེན་པོ་ བལྟ་ ན་ སྡུག་ ན་ ལྷ འི་ འདུན་ས་ ཆོས་ བཟང་ དག་ གི་ འདོད་པ འི་ ཡོན་ཏན་ ལྔ་ འབྱོར་པ ར་ གྱུར་པ འི་ ལྷ་ རྣམས་ ཀྱི་ དབང་པོ་ ཀཽ་ཤི་ཀ་ ལ་ སྔ་མ་ བཞིན་ རྒྱ་ ཆེ ར་ བསྙད་ དོ །_།
en: $134 “In this way the gods of the Four Great Kings [20.b] will spread the news of this campaign against the Dharma far and wide. |#| All the details will, as before, gradually be conveyed all the way up to Kauśika, who—as the lord of the gods endowed with abundant pleasures of the five senses—resides within his Sudharma hall in the city of Sudarśana.

source: དེ་ནས་ ལྷ་ རྣམས་ ཀྱི་ དབང་པོ་ ཀཽ་ཤི་ཀ ས་ འཇིག་རྟེན་ སྐྱོང་བ་ རྣམས་ ལ་ བསྒོ་བ །_
en: Kauśika, lord of the gods, will then employ the guardians of the world, enjoining them as follows:

source: འཇིག་རྟེན་ སྐྱོང་བ་ དག་ འཛམ་བུ འི་ གླིང་ ན་ ཅི་ སངས་རྒྱས་ དཀོན་མཆོག་ ལ་ དད་ དམ །_
en: ‘Guardians of the world, do the people of Jambudvīpa have faith in the jewel of the Buddha?

source: ཆོས་ དཀོན་མཆོག་ ལ་ དད་ དམ །_
en: Do they have faith in the jewel of the Dharma?

source: དགེ་འདུན་ དཀོན་མཆོག་ ལ་ དད་ དམ །_
en: Do they have faith in the jewel of the Saṅgha?

source: དགེ་སྦྱོང་ དུ་ འཛིན་ ཏམ །_
en: Do they respect mendicants?

source: བྲམ་ཟེ ར་ འཛིན་ ཏམ །_
en: Do they respect brahmins?

source: བྱས་པ་ གཟོའམ །_
en: Do they return kindness?

source: བྱས་པ་ ལ་ ཕན་ འདོགས་ སམ །_
en: Do they repay help?

source: དྲང་བ་ ཡིན་ ནམ །_
en: Are they honest?

source: དྲང་བ འི་ རང་བཞིན་ ཅན་ ཡིན་ ནམ །_
en: Are they of an honest character?

source: མར་ འཛིན་ ཏམ །_
en: Do they respect their mothers?

source: ཕ ར་ འཛིན་ ཏམ །_
en: Do they respect their fathers?

source: རིགས་ ཀྱི་ རྒན་རབས་ ལ་ གུས་པ ར་ བྱེད་ དམ །_
en: Are they devoted to the elders of their families?

source: ཚེས་གྲངས་ ཀྱི་ སྨྱུང་བ་ ལ་ཉེ་ བར་གནས་ སམ །_
en: Do they observe their periodic fasts?

source: གཡོ་ ཐབས་ དང་ ཚུལ་འཆོས་པ་ ལ་མ་ ཆགས་ སམ །_
en: Do they stay clear of deceit and pretense?

source: གཞལ་ ལུགས་ ལ་ གཡོ་ བྱེད་ ཅིང་ མི་ སླུའམ །_
en: Are their scales and weights free from trickery and deception?

source: ཕན་ཚུན་ གནོད་པ་ དག་བྱེད་ དམ་ མི་ བྱེད །_
en: Do they harm one another, or do they not?

source: འཛམ་བུ འི་ གླིང་ དུ་ དེང་ ལ་ རྟོགས་ ཤིག་ ཅེས་ བསྒོ་བ་ དང་ །_
en: Go to Jambudvīpa and find out!’

source: ལྷ་ དེ་ལྟ ར་ འཚལ་ ལོ་ ཞེས་ སྨྲས་ ནས །_ འཇིག་རྟེན་ སྐྱོང་བ་ དག་ མི་ རྣམས་ ལ་ ཕན་པ ར་ བྱ་བ འི་ ཕྱིར་ འཛམ་བུ འི་ གླིང་ག་ ལ་བ་ དེར་ དོང་ སྟེ །_ ཡུལ་ ནས་ ཡུལ །_ ལྗོངས་ ནས་ ལྗོངས །_ གྲོང་རྡལ་ ནས་ གྲོང་རྡལ །_ གྲོང་ ནས་ གྲོང་ །_ གྲོང་ཁྱེར་ ནས་ གྲོང་ཁྱེར །_ ཚོང་རྡལ་ ནས་ ཚོང་རྡལ་ དུ་ དེ་དག་ རྟོག་པ ར་ བྱེད་ དེ །_ འཛམ་བུ འི་ གླིང་ ན་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ མི་ དག་ གང་ གནས་པ་ འཛམ་བུ འི་ གླིང་ འདི་ ཐམས་ཅད་ ལ་ སྔ་མ་ བཞིན་ སོ་སོ ར་ རྟོག་པ ར་ བྱེད་ དོ །_།
en: $135 “In response the gods will say, ‘As you command!’ and so they will depart for Jambudvīpa to help the humans who live there. Traveling throughout Jambudvīpa—from country to country, district to district, village to village, town to town, city to city, and market to market—they will determine where and how the righteous people who follow the Dharma live.

source: འཇིག་རྟེན་ སྐྱོང་བ་ བཞི་པོ་ དེ་དག་ གལ་ཏེ །_ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ སྐྱེ་དགུ་ དག་ མཐོང་ ན་ དེ་ལྟ ར་ རྒྱ་མཚོ འི་ ནང་ དུ་ ཞུགས་ ནས་ ལོངས་སྤྱོད་ ལྡན་ ན་ གནས་པ འི་ ཀླུ་ ནོར་ རྒྱས་ ཀྱི་ བུ་ དང་ །_ འཇོག་པོ་ ལ་སོགས་པ་ ལ་ ཀླུ་ དག་མ་ འཇིགས་ ཤིག _།
en: When the four guardians of the world encounter righteous people who follow the Dharma, they will tell them, ‘Do not be afraid of nāgas such as Vāsuki and Takṣaka, who live among their treasures within the ocean.

source: གྲོགས་པོ་ དག་མ་ འཇིགས་ ཤིག _།
en: Friends, do not be afraid!

source: དམ་པ འི་ ཆོས་ ཀྱི་ ཕྱོགས་ ནི་ འཕེལ་ ལོ །_།
en: The forces of the sacred Dharma are on the rise.

source: བདུད་ ཀྱི་ ཕྱོགས་ ནི་ འགྲིབ་བོ །_།
en: The forces of the māras are waning.

source: བདུད་ ཀྱི་ ཕྱོགས་ ནི་ སྲབས་ སོ །_།
en: The forces of the māras are weak.

source: ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ [21a] འཇུག་པ འི་ ལྷ་ དང་ མི་ དང་ ཀླུ་ རྣམས་ རབ་ཏུ་ དག འོ །_།
en: [21.a] The righteous gods, humans, and nāgas who follow the Dharma are celebrating.

source: ཆོས་ ཀྱི་ རྔ་ ནི་ ཀུན་ ཏུ་ བརྡུངས་ སོ །_།
en: They beat the drum of the Dharma.

source: ཆོས་ ཀྱི་ དབྱངས་ རབ་ཏུ་ ལེན་ དུ་ བཅུག་ སྟེ །_
en: They sing the melodies of the Dharma.

source: ལྷ འི་ ཕྱོགས་ ནི་ འཕེལ་ ལོ །_།
en: The forces of the gods are on the rise.

source: ཀླུ་ དང་ ལྷ་མ་ ཡིན་ ཆོས་ དང་ མི་ ལྡན་པ་ རྣམས་ ནི་ འགྲིབ་ ཅིང་ འདུག་ གོ་ ཞེས་ བསྙད་ དོ །_།
en: The nāgas and asuras who have no Dharma remain weak.’

source: དེ་ ཐོས་ ནས་ ཀླུ་ ནོར་ རྒྱས་ ཀྱི་ བུ་ དང་ །_ འཇོག་པོ་ ལ་སོགས་པ་ དགའ་བ ར་ གྱུར་པ་ རྣམས་ ཀྱིས་
en: $136 “When they hear this, Vāsuki, Takṣaka, and other such nāgas will be delighted.

source: འཇིག་རྟེན་ སྐྱོང་བ་ མགུ་བ་ དག་ ལ་ འདི་སྐད་ ཅེས་
en: Full of appreciation, they will say to the guardians of the world,

source: ལྷ་ དག་ བདག་ཅག་ རབ་ཏུ་ དགའ་ སྟེ །_
en: ‘Gods, we are overjoyed!

source: བདག་ཅག་ དང་ མི འི་ འཇིག་རྟེན་ ན་ མི་ རྣམས་ ལ་ ཀླུ་ དང་ ལྷ་མ་ ཡིན་ ཆོས་ དང་ མི་ ལྡན་པ་ རྣམས་ ཀྱིས་ བར་ཆད་ བྱ་བ ར་ མི་ ནུས་ ཏེ །_
en: The unrighteous nāgas and asuras will not succeed in creating obstacles for us, nor for human beings.

source: རབ་ཏུ་ དགའ་ ཞིང་ མཆིས་ སོ་ ཞེས་ དེ་སྐད་ ལྷ་ རྣམས་ ཀྱི་ དབང་པོ་ བརྒྱ་བྱིན་ ལ་ གསོལ་ ཅིག་ ཅེས་ སྨྲས་པ་ དང་ །_
en: Please convey to Śakra, lord of the gods, that we are overjoyed.’

source: དེ་སྐད་ ཐོས་ ནས་ ཀླུ་ རྣམས་ ཀྱི་ དྲུང་ ནས །_ འཇིག་རྟེན་ སྐྱོང་བ་ དག་ ལྷ་ རྣམས་ ཀྱི་ དབང་པོ་ བརྒྱ་བྱིན་ ག་ལ་བ་ དེར་ དོང་ སྟེ །_
en: $137 “Upon receiving this message, the guardians of the world will take leave from the nāgas and journey to the residence of Śakra, lord of the gods.

source: སྔ་མ་ བཞིན་ དེ་སྐད་ བསྙད་པ་ དང་ །_ དེ་ནས་ ལྷ་ རྣམས་ ཀྱི་ དབང་པོ་ བརྒྱ་བྱིན་ ཡིད་ རབ་ཏུ་ དགའ་ ནས །_། འདི་ལྟར་ ཚིགས་ སུ་ བཅད་ དེ་ སྨྲས་པ །_
en: As they convey the nāgas’ message to Śakra, he will rejoice deeply and say:

source: ཐུབ་པ་ དེ་ཉིད་ གཟིགས་པ་ ཡིས །_། ཁྱེད་ ལ་ ལམ་ བཏོད་ འདི་ གསུངས་ ལ །_།
en: $138 “ ‘The Able One who perceives reality Has given you the teachings of the path.

source: མི་གང་ རབ་ཏུ་ གནས་པ་ ནི །_། ལྷ་ ཡི་ འདུན་ས ར་ འགྲོ་བ ར་ འགྱུར །_།
en: Humans who follow it Proceed to the assembly of the gods.

source: སེམས་ཅན་ རྣམས་ ལ་ བདེན་ དང་ དེ་བཞིན་ དུ །_། སྦྱིན་ དང་ བྱམས་པ་ སྲུང་ ཞིང་ ཚིག་ སྙན་ སྨྲ །_། ཡང་དག་ ལྟ་ དང་ དྲི་མ་ བྲལ་བ འི་ ཡིད །_། སངས་རྒྱས་ ཀྱིས་ ནི་ མཐོ་རིས་ ལམ་ དུ་ གསུངས །_།
en: $139 “ ‘Speaking truth to sentient beings, As well as generosity, love, pleasant words, The true view, and the stainless mind— These, as the Buddha has taught, are the path to higher realms.

source: དཀར་པོ འི་ ཆོས་ དང་ ཡང་དག་ ལྡན །_། དཀར་པོ འི་ ཆོས་ ལ་ རྟེན་པ་ རྣམས །_།
en: $140 “ ‘When endowed with the qualities of virtue, You rely on the qualities of virtue.

source: སྣང་ ལས་སྣང་བ འི་ མེ་ཏོག་ དང་ །_། སྒྲོན་ ལས་ སྒྲོན་མ་ གཞན་ འབྱུང་ ལྟར །_།
en: It is like flowers of light growing from light, Or one lamp that gives rise to others.

source: སྣང་ ལས་སྣང་བ འི་ མཆོག་ འབྱུང་ ཞིང་ །_། བདེ་ ལས་ ཤིན་ཏུ་ བདེ་བ ར་ འགྲོ །_།
en: $141 “ ‘Thus, from the light arises supreme light And from bliss arises supreme bliss.

source: དེ་བ ས་ སྐྱེས་བུ་ སྒྲོན་མ་ མཆོག _། ངམ་གྲོག་ ཏུ་ ནི་ ལྟུང་ མི་ འགྱུར །_།
en: Therefore, do not let this sublime lamp of humanity Fall into the precipice.

source: རྟག་ ཏུ་ ནོར་བུ་ དྲི་མེད་ ལྟར །_། རྟག་ ཏུ་ གང་ཞིག་ སེམས་ དག་པ །_། དེ་ ནི་ ཞི་ སྟེ་ ང་ མེད་ བརྟན །_། ལྷ་ རྣམས་ ཀྱི་ ནི་ ནང་ དུ་ འགྲོ །_།
en: $142 “ ‘Like an ever-stainless jewel, Those whose minds are always pure, Who are serene and adhere to egolessness, Are those who will walk among the gods.

source: བསམ་གཏན་ ཚུལ་ཁྲིམས་ ཏིང་འཛིན་ དག _། གང་ གི་ སེམས་ ལ་ ཤིན་ཏུ་ བསྒོམས །_། བརྟན་པོ་ དེ་ ནི་ གསེར་ འདྲ་ སྟེ །_། ལྷ་ རྣམས་ ཀྱི་ ནི་ ནང་ དུ་ འགྲོ །_།
en: $143 “ ‘Those endowed with concentration, discipline, and absorption, Such steadfast ones who constantly train their minds, Are like pure gold, And will walk among the gods.

source: སྲོག་གཅོད་པ་ དག་ སྤངས་པ་ དང་ །_། སེམས་ཅན་ ཀུན་ ལ་ སྙིང་རྗེ་ མཆོག _། བརྩེ་ ལྡན་ དྲང་པོ་ ཞི་བ་ དག _། ལྷ་ རྣམས་ ཀྱི་ ནི་ ནང་ དུ་ འགྲོ །_།
en: $144 “ ‘Those who give up killing, Have supreme compassion for all beings, And are loving, honest, and peaceful Will walk among the gods. [21.b]

source: [21b] འཇིག་རྟེན་ ཀུན་ ལ་ ཚིག་འཇམ་ ཞིང་ །_། ཞེ་སྡང་ ལས་ ནི་ རྣམ་ སྤངས་ ལ །_། སྡིག་པ འི་ ཆོས་ ཀྱིས་ མ་ གོས་པ །_། ལྷ་ རྣམས་ ཀྱི་ ནི་ ནང་ དུ་ འགྲོ །_།
en: $145 “ ‘Those who speak gently throughout the world, Give up aggressive acts, And remain unsullied by unwholesome qualities Will walk among the gods.

source: གང་ ལ་ རྩྭ་ དང་ གསེར་ མཉམ་ ཞིང་ །_། གང་ གིས་ འདོད་པ་ དུག་ ལྟ་བུ །_། འདོད་པ་ སྤངས་པ འི་ བརྟན་པོ་ དེ །_། ལྷ་ རྣམས་ ཀྱི་ ནི་ ནང་ དུ་ འགྲོ །_།
en: $146 “ ‘Those for whom grass and gold are the same, Who regard desire as poison, And who are firm in their relinquishment of desire Will walk among the gods.

source: འདོད་ཆགས་ རྒྱུ་ སྟེ་ ཡིད་འོང་བ འི །_། ཡུལ་ གྱིས་ མ་དྲངས་ གང་ཡིན་པ །_། དེ་ ནི་ འཇིགས་པ འི་ དགོན་ ལས་ རྒལ །_། ལྷ་ རྣམས་ ཀྱི་ ནི་ ནང་ དུ་ འགྲོ །_།
en: $147 “ ‘Those who cannot be stirred Toward attractive objects, the causes of desire, Will cross the terrifying precipice And walk among the gods.

source: གྲོགས་པོ་ གཉེན་བཤེས་ རྩ་ལག་ དང་ །_། ཕན་ཚུན་ མི་ འཐུན་ གྱུར་པ་ ལ །_། གང་ཞིག་ ཤིན་ཏུ་ སྡུམས་ བྱེད་པ །_། ལྷ་ རྣམས་ ཀྱི་ ནི་ ནང་ དུ་ འགྲོ །_།
en: $148 “ ‘When friends, allies, and family members Have fallen into discord, Those who lead them to reconciliation Will walk among the gods.

source: འདོད་པ འི་ འདམ་ ལས་ དྲངས་ ཤིང་ སྐྱོན་ བསལ་བ །_། སེམས་ཅན་ ཀུན་ ལ་ རྟག་ ཏུ་ བདེ་ འདོད་ གང་ །_། དེ་ ནི་ དྲི་མེད་ ཞི་བ་ ཡིད་ གྲོལ་ ཞིང་ །_། དེ་ལྟ ར་ བདུད་ ཀྱི་ སྟོབས་ ནི་ འཇོམས་པ ར་ བྱེད །_།
en: $149 “ ‘Those who emerge unstained from the mud of desire, Who always wish for beings to be happy, And whose minds are stainless, peaceful, and free, Will conquer the forces of the māras.

source: གང་ཞིག་ དབང་ ལ་ བློ་ གནས་ ཤིང་ །_། བློ་ ཡི་ དབང་ དུ་ མི་ འགྲོ་ གང་ །_། དེ་ ནི་ དགྲ་ ལས་ རྣམ་རྒྱལ་ ཏེ །_། ལྷ་ རྣམས་ ཀྱི་ ནི་ ནང་ དུ་ འགྲོ །_།
en: $150 “ ‘Those who have control of their minds, And are not controlled by their minds, Will be victorious against the enemy And walk among the gods.

source: ལུས་ ཀྱི་ ལས་ མཐའ་ དགེ་བ་ དག _། སྡིག་ལས་ བྲལ་བ་ བདེ་ལྡན་ གང་ །_། དེ་ ནི་ འདོད་ སྤངས་ བསམ་གཏན་པ །_། ལྷ་ རྣམས་ ཀྱི་ ནི་ ནང་ དུ་ འགྲོ །_།
en: $151 “ ‘Those who pursue a virtuous livelihood, Are free from unwholesomeness and at ease, And give up desires and practice concentration Will walk among the gods.

source: སྡིག་པ འི་ གྲོགས་པོ་ རྣམ་ སྤངས་ ཤིང་ །_། སྲེད་པ འི་ ཞགས་ ལས་ རྣམ་གྲོལ་བ །_། བུད་མེད་ ཞགས་པ ས་ མ་ བཅིངས་པ །_། ལྷ་ རྣམས་ ཀྱི་ ནི་ ནང་ དུ་ འགྲོ །_།
en: $152 “ ‘Those who give up unwholesome company, Free themselves from the shackles of craving, And are not bound by the ties of women Will walk among the gods.

source: གང་དག་ ཆོས་ ལ་ རབ་ འབད་ ཅིང་ །_། སྦྱིན་ དང་ ཚུལ་ཁྲིམས་ ཏིང་འཛིན་ ལྡན །_། བློ་གྲོས་ བརྟན་ ཞིང་ རྟག་ བརྩོན་པ །_། ལྷ་ རྣམས་ ཀྱི་ ནི་ ནང་ དུ་ འགྲོ །_།
en: $153 “ ‘Those who persevere in the Dharma, Who practice generosity, discipline, and absorption, And who possess steadfast intelligence and constant diligence Will walk among the gods.

source: རལ་གྲི ས་ ཞགས་པ་ བཅད་པ་ ལྟར །_། གང་ གིས་ འཆིང་བ་ བཅད་པ་ དེ །_། རང་དབང་ ཞགས་པ་ བཅད་པ་ ཡིན །_། ལྷ་ རྣམས་ ཀྱི་ ནི་ ནང་ དུ་ འགྲོ །_།
en: $154 “ ‘Like a sword that cuts through shackles, Those who sever their bonds And independently cut through their chains Will walk among the gods.

source: འདོད་པ འི་ དྲི་མ ས་ མ་ གོས་ བརྐམ་པ་ མེད །_། སྐྱོན་ དག་ སྤངས་ ཤིང་ བཅོམ་ སྟེ་ སྲེད་ དང་ བྲལ །_། ཉེས་མེད་ དྲི་བྲལ་ སེམས་ཅན་ བརྟན་པ་ དེ །_། རང་ གི་ འབྲས་བུ་ ལ་ སྤྱོད་ མཐོ་རིས་ འགྲོ །_།
en: $155 “ ‘Those unstained by desire and free from greed, Who have abandoned and conquered the flaws and are free from craving, And who are blameless, stainless, and steadfast Will experience the effects of that and travel to the higher realms.
